[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:38:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/articles" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/articles"}

Number of calls: 0
