[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit Article</h1>
         {
-          article && <ArticlesForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
