[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:49:42
                     type="text"
                     isInvalid={Boolean(errors.name)}
                     defaultValue={initialContents ? initialContents.name : ""}
-                    {...register("name", {
-                        required: "Name is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:49:34
                     type="text"
                     isInvalid={Boolean(errors.name)}
                     defaultValue={initialContents ? initialContents.name : ""}
-                    {...register("name", {
+                    {...register("", {
                         required: "Name is required.",
                         maxLength : {
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:70:55
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
                     defaultValue={initialContents ? initialContents.diningCommonsCode : ""}
-                    {...register("diningCommonsCode", {
-                        required: "Dining commons code is required.",
-                        validate: {
-                            validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) || `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
-                        }
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Dining commons code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:71:35
                     isInvalid={Boolean(errors.diningCommonsCode)}
                     defaultValue={initialContents ? initialContents.diningCommonsCode : ""}
                     {...register("diningCommonsCode", {
-                        required: "Dining commons code is required.",
+                        required: "",
                         validate: {
                             validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) || `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Dining commons code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:72:35
                     defaultValue={initialContents ? initialContents.diningCommonsCode : ""}
                     {...register("diningCommonsCode", {
                         required: "Dining commons code is required.",
-                        validate: {
-                            validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) || `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
-                        }
+                        validate: {}
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Invalid dining commons code. Options are: carillo, de-la-guerra, portola, ortega/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:73:58
                     {...register("diningCommonsCode", {
                         required: "Dining commons code is required.",
                         validate: {
-                            validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) || `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
+                            validDiningCommonsCode: v => false
                         }
                     })}
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Invalid dining commons code. Options are: carillo, de-la-guerra, portola, ortega/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:73:58
                     {...register("diningCommonsCode", {
                         required: "Dining commons code is required.",
                         validate: {
-                            validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) || `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
+                            validDiningCommonsCode: v => validDiningCommonsCodes.includes(v) && `Invalid dining commons code. Options are: ${validDiningCommonsCodes.join(', ')}`
                         }
                     })}
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Invalid dining commons code. Options are: carillo, de-la-guerra, portola, ortega/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:90:34
                     type="text"
                     isInvalid={Boolean(errors.station)}
                     defaultValue={initialContents ? initialContents.station : ""}
-                    {...register("station", {
+                    {...register("", {
                         required: "Station name is required."
                     })}
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:91:35
                     isInvalid={Boolean(errors.station)}
                     defaultValue={initialContents ? initialContents.station : ""}
                     {...register("station", {
-                        required: "Station name is required."
+                        required: ""
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Station name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
