[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:25:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={"ArticlesForm-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: ArticlesForm tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticlesForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:25:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={"ArticlesForm-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid={"ArticlesForm-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:42:34
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="title">Title</Form.Label>
                 <Form.Control
-                    data-testid={"ArticlesForm-title"}
+                    data-testid={""}
                     id="title"
                     type="text"
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:113:22
                     {...register("dateAdded", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded && 'DateAdded is required and must be in ISO format. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /DateAdded is required and must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:113:22
                     {...register("dateAdded", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded && 'DateAdded is required and must be in ISO format. '}
+                    {errors.dateAdded || 'DateAdded is required and must be in ISO format. '}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:127:30
             <Button
                 variant="Secondary"
                 onClick={() => navigate(-1)}
-                data-testid={"ArticlesForm-cancel"}
+                data-testid={""}
             >
                 Cancel
killedBy: ArticlesForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-cancel"]

<body>
  <div>
    <form
      class=""
    >
      <div
